#############################################################################################
# ~/.zshrc 2025.5.31作成
# zshrcは、~/.zprofileに記述するログイン時に設定したい環境変数以外を設定する
# 設定を有効にするには、シェルにログインし直す（ターミナルを再起動する）
#############################################################################################

# 色を使用できるようにする
autoload -Uz colors
colors
# export COLORTERM=truecolor 
# export TERM=xterm-256color  プロンプトの表示設定

# プロンプトの表示設定
# PROMPT="%{$fg[green]%}%n@%m%{$reset_color%}:%~%# " 
#
# 2行で表示 zshでは\nが効かないらしく、実際に改行する必要がある
 # %{...%}：非表示文字列の囲い（Zshがプロンプトの表示幅を正しく数えるために必要)
 # fgはzsh組み込みコマンド、reset_colorはzsh組み込み変数 
PROMPT="%{$fg[green]%}%n@%m%{$reset_color%}:%~
$ " 

##############################################################################################
# エイリアスの設定                                            

# rmコマンドを再定義"-i"オプションでrm実行時に確認メッセージが表示される 
alias rm='rm -i'                                                         

# ls の出力結果を色付きにする                                            
alias ls='ls -G'                                                         

# Chromeを開く                                                           
alias Chrome='open -a Google\ Chrome'                                    
